Revit 2024 API
MultiServerService.ExecutionPolicy Property
 Specifies how a multi-server service executes servers during its execution.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ExecutionPolicy ExecutionPolicy { get; }
Visual Basic
Public ReadOnly Property ExecutionPolicy As ExecutionPolicy
	Get
Visual C++
public:
property ExecutionPolicy ExecutionPolicy {
	ExecutionPolicy get ();
}
Remarks
 Read descriptions for the items in the ExecutionPolicy enum to find out details about all applicable execution policies.
See Also
MultiServerService Class
Autodesk.Revit.DB.ExternalService Namespace